; domain
; IPC5 Domain: Storage Propositional
; Authors: Alfonso Gerevini and Alessandro Saetti 

(define (domain Storage)
(:requirements :typing)
(:types hoist surface place area - object
	container depot - place
	storearea transitarea - area
	area crate - surface)

(:predicates (clear ?s - storearea)
	     (in ?x - object ?p - place)
	     (available ?h - hoist) 
	     (lifting ?h - hoist ?c - crate) 
	     (at ?h - hoist ?a - area)
	     (on ?c - crate ?s - storearea) 
	     (connected ?a1 ?a2 - area)) 

(:action lift
 :parameters (?h - hoist ?c - crate ?a1 - storearea ?a2 - area ?p - place)
 :precondition (and (connected ?a1 ?a2) (at ?h ?a2) (available ?h) 
		    (on ?c ?a1) (in ?a1 ?p))
 :effect (and (not (on ?c ?a1)) (clear ?a1)
	      (not (available ?h)) (lifting ?h ?c) (not (in ?c ?p))))
				
(:action drop
 :parameters (?h - hoist ?c - crate ?a1 - storearea ?a2 - area ?p - place)
 :precondition (and (connected ?a1 ?a2) (at ?h ?a2) (lifting ?h ?c) 
		    (clear ?a1) (in ?a1 ?p))
 :effect (and (not (lifting ?h ?c)) (available ?h)
	      (not (clear ?a1)) (on ?c ?a1) (in ?c ?p)))

(:action move
 :parameters (?h - hoist ?from ?to - storearea)
 :precondition (and (at ?h ?from) (clear ?to) (connected ?from ?to))
 :effect (and (not (at ?h ?from)) (at ?h ?to) (not (clear ?to)) (clear ?from)))

(:action go-out
 :parameters (?h - hoist ?from - storearea ?to - transitarea)
 :precondition (and (at ?h ?from) (connected ?from ?to))
 :effect (and (not (at ?h ?from)) (at ?h ?to) (clear ?from)))

(:action go-in
 :parameters (?h - hoist ?from - transitarea ?to - storearea)
 :precondition (and (at ?h ?from) (connected ?from ?to) (clear ?to))
 :effect (and (not (at ?h ?from)) (at ?h ?to) (not (clear ?to))))
)

; problem
; Map of the Depots:         
; 000    
; 0*0    
;----    
; 0: depot0 area
; *: Depot access point
; =: Transit area

(define (problem storage-9)
(:domain Storage)
(:objects
	depot0-1-1 depot0-1-2 depot0-1-3 depot0-2-1 depot0-2-2 depot0-2-3 container-0-0 container-0-1 container-0-2 - storearea
	hoist0 hoist1 hoist2 - hoist
	crate0 crate1 crate2 - crate
	container0 - container
	depot0 - depot
	loadarea - transitarea)

(:init
	(connected depot0-1-1 depot0-2-1)
	(connected depot0-1-1 depot0-1-2)
	(connected depot0-1-2 depot0-2-2)
	(connected depot0-1-2 depot0-1-3)
	(connected depot0-1-2 depot0-1-1)
	(connected depot0-1-3 depot0-2-3)
	(connected depot0-1-3 depot0-1-2)
	(connected depot0-2-1 depot0-1-1)
	(connected depot0-2-1 depot0-2-2)
	(connected depot0-2-2 depot0-1-2)
	(connected depot0-2-2 depot0-2-3)
	(connected depot0-2-2 depot0-2-1)
	(connected depot0-2-3 depot0-1-3)
	(connected depot0-2-3 depot0-2-2)
	(in depot0-1-1 depot0)
	(in depot0-1-2 depot0)
	(in depot0-1-3 depot0)
	(in depot0-2-1 depot0)
	(in depot0-2-2 depot0)
	(in depot0-2-3 depot0)
	(on crate0 container-0-0)
	(on crate1 container-0-1)
	(on crate2 container-0-2)
	(in crate0 container0)
	(in crate1 container0)
	(in crate2 container0)
	(in container-0-0 container0)
	(in container-0-1 container0)
	(in container-0-2 container0)
	(connected loadarea container-0-0) 
	(connected container-0-0 loadarea)
	(connected loadarea container-0-1) 
	(connected container-0-1 loadarea)
	(connected loadarea container-0-2) 
	(connected container-0-2 loadarea)  
	(connected depot0-2-2 loadarea)
	(connected loadarea depot0-2-2)  
	(clear depot0-2-1)
	(clear depot0-1-2)
	(clear depot0-1-3)  
	(at hoist0 depot0-2-2)
	(available hoist0)
	(at hoist1 depot0-1-1)
	(available hoist1)
	(at hoist2 depot0-2-3)
	(available hoist2))

(:goal (and
	(in crate0 depot0)
	(in crate1 depot0)
	(in crate2 depot0)))

(:metric minimize (total-time))
)

; plan
1. (go-out hoist0 depot0-2-2 loadarea)
   deleted: (at hoist0 depot0-2-2)
   added: (at hoist0 loadarea) (clear depot0-2-2)
   goals met: 0 of 3
2. (lift hoist0 crate0 container-0-0 loadarea container0)
   deleted: (on crate0 container-0-0) (available hoist0) (in crate0 container0)
   added: (clear container-0-0) (lifting hoist0 crate0)
   goals met: 0 of 3
3. (go-in hoist0 loadarea depot0-2-2)
   deleted: (at hoist0 loadarea) (clear depot0-2-2)
   added: (at hoist0 depot0-2-2)
   goals met: 0 of 3
4. (drop hoist0 crate0 depot0-1-2 depot0-2-2 depot0)
   deleted: (lifting hoist0 crate0) (clear depot0-1-2)
   added: (available hoist0) (on crate0 depot0-1-2) (in crate0 depot0)
   goals met: 1 of 3
5. (go-out hoist0 depot0-2-2 loadarea)
   deleted: (at hoist0 depot0-2-2)
   added: (at hoist0 loadarea) (clear depot0-2-2)
   goals met: 1 of 3
6. (lift hoist0 crate1 container-0-1 loadarea container0)
   deleted: (on crate1 container-0-1) (available hoist0) (in crate1 container0)
   added: (clear container-0-1) (lifting hoist0 crate1)
   goals met: 1 of 3
7. (drop hoist0 crate1 depot0-2-2 loadarea depot0)
   deleted: (lifting hoist0 crate1) (clear depot0-2-2)
   added: (available hoist0) (on crate1 depot0-2-2) (in crate1 depot0)
   goals met: 2 of 3
8. (lift hoist0 crate2 container-0-2 loadarea container0)
   deleted: (on crate2 container-0-2) (available hoist0) (in crate2 container0)
   added: (clear container-0-2) (lifting hoist0 crate2)
   goals met: 2 of 3
9. (lift hoist2 crate1 depot0-2-2 depot0-2-3 depot0)
   deleted: (on crate1 depot0-2-2) (available hoist2) (in crate1 depot0)
   added: (clear depot0-2-2) (lifting hoist2 crate1)
   goals met: 1 of 3
10. (drop hoist0 crate2 depot0-2-2 loadarea depot0)
   deleted: (lifting hoist0 crate2) (clear depot0-2-2)
   added: (available hoist0) (on crate2 depot0-2-2) (in crate2 depot0)
   goals met: 2 of 3
11. (drop hoist2 crate1 depot0-1-3 depot0-2-3 depot0)
   deleted: (lifting hoist2 crate1) (clear depot0-1-3)
   added: (available hoist2) (on crate1 depot0-1-3) (in crate1 depot0)
   goals met: 3 of 3
